; domain
(define (domain GROCERY)
	(:requirements :strips :typing)
	(:types item)
	(:predicates (on ?x - item ?y - item)
		(ontable ?x - item)
		(cleartop ?x - item)
		(handempty)
		(holding ?x - item)
		(clearleft ?x - item)
		(clearright ?x - item)
		(toleft ?x - item ?y - item)
		(toright ?x - item ?y - item)
		)
		
	(:action pick-up
	        :parameters (?x - item)
	        :precondition (and (cleartop ?x) (handempty))
	        :effect
	        (and (not (ontable ?x))
	            (not (handempty))
	            (not (cleartop ?x))
	            (holding ?x)))
	            
	(:action put-on-table
	    :parameters (?x - item)
	    :precondition (holding ?x)
	    :effect
	    (and (not (holding ?x))
	    (cleartop ?x)
	    (handempty)
	    (ontable ?x)))
	    
	
	(:action put-on 
	        :parameters (?x - item ?y - item)
	        :precondition (and (holding ?x) (cleartop ?y) )
	        :effect
	        (and (not (holding ?x))
	        (not (cleartop ?y))
	        (cleartop ?x)
	        (handempty)
	        (on ?x ?y)))
	        
	        
	(:action put-left
	        :parameters (?x - item ?y - item)
	        :precondition (and (holding ?x) (clearleft ?y) (ontable ?y))
	        :effect
	        (and (not (holding ?x))
	        (not (clearleft ?y))
	        (clearleft ?x)
	        (handempty)
	        (toleft ?x ?y)))
	
	(:action put-right
	        :parameters (?x - item ?y - item)
	        :precondition (and (holding ?x) (clearright ?y) (ontable ?y))
	        :effect
	        (and (not (holding ?x))
	        (not (clearright ?y))
	        (clearright ?x)
	        (handempty)
	        (toright ?x ?y)))
	        
)

; problem
(define (problem PACKED-GROCERY)
(:domain GROCERY)
(:objects bleach nutella coke pepsi lipton - item)

(:init  (cleartop bleach) (cleartop coke) (handempty) 
        (cleartop lipton) (cleartop nutella) (cleartop pepsi)
        (clearleft bleach) (clearleft nutella) (clearleft pepsi)
        (clearleft lipton) (clearleft coke) (clearright bleach)
        (clearright nutella) (clearright pepsi) (clearright coke)
        (clearright lipton))

(:goal (and (on coke bleach) (on lipton coke) (toleft nutella bleach) (toright pepsi bleach))))

; plan
1. (pick-up bleach)
   deleted: (handempty) (cleartop bleach)
   added: (holding bleach)
   goals met: 0 of 4
2. (put-on-table bleach)
   deleted: (holding bleach)
   added: (cleartop bleach) (handempty) (ontable bleach)
   goals met: 0 of 4
3. (pick-up nutella)
   deleted: (handempty) (cleartop nutella)
   added: (holding nutella)
   goals met: 0 of 4
4. (put-left nutella bleach)
   deleted: (holding nutella) (clearleft bleach)
   added: (handempty) (toleft nutella bleach)
   goals met: 1 of 4
5. (pick-up coke)
   deleted: (handempty) (cleartop coke)
   added: (holding coke)
   goals met: 1 of 4
6. (put-on coke bleach)
   deleted: (holding coke) (cleartop bleach)
   added: (cleartop coke) (handempty) (on coke bleach)
   goals met: 2 of 4
7. (pick-up lipton)
   deleted: (handempty) (cleartop lipton)
   added: (holding lipton)
   goals met: 2 of 4
8. (put-on lipton coke)
   deleted: (holding lipton) (cleartop coke)
   added: (cleartop lipton) (handempty) (on lipton coke)
   goals met: 3 of 4
9. (pick-up pepsi)
   deleted: (handempty) (cleartop pepsi)
   added: (holding pepsi)
   goals met: 3 of 4
10. (put-right pepsi bleach)
   deleted: (holding pepsi) (clearright bleach)
   added: (handempty) (toright pepsi bleach)
   goals met: 4 of 4
